app/controllers/chirps_controller.rb

SELECT COUNT(*) FROM "chirps"
---
	def index
		@chirps = Chirp.all.order("created_at DESC").paginate(page: params[:page], per_page: 3)

INSERT INTO "chirps" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello There!!!"], ["user_id", 1], ["created_at", "2015-05-11 21:19:59.840203"], ["updated_at", "2015-05-11 21:19:59.840203"]]
---
	def create
		@chirp= Chirp.new(params.require(:chirp).permit(:body).merge(user: current_user))

		if @chirp.save

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "chirps" WHERE "chirps"."id" = ?  [["id", 1]]
---
	def destroy
		@chirp = Chirp.find(params[:id])
		@chirp.destroy